Feature: Вход в системата

  Scenario: Вход в системата с валидни потребителски данни
    Given Портебителя отваря екрана за вход в системата
    When Въвежда потребителско име "Ivan"
    And Въвежда парола "Pass123"
    And Натиска бутона за вход в системата
    Then Вижда съобщение "ОК".
    
   Scenario: Вход в системата с невалидни потребителски данни
    Given Портебителя отваря екрана за вход в системата
    When Въвежда потребителско име "Ivan123"
    And Въвежда парола "123Pass123"
    And Натиска бутона за вход в системата
    Then Вижда съобщение "Потребител с тези данни не съществува!".
    
   Scenario: Вход в системата без парола
    Given Портебителя отваря екрана за вход в системата
    When Въвежда потребителско име "Ivan123"
    And Натиска бутона за вход в системата
    Then Вижда съобщение "Моля въведете парола!".
    
   Scenario: Вход в системата без потребителски данни
    Given Портебителя отваря екрана за вход в системата
    When Натиска бутона за вход в системата
    Then Вижда съобщение "Моля въведете потребителско име и парола!".
    
   Scenario: Вход в системата без потребителско име
    Given Портебителя отваря екрана за вход в системата
    When Въвежда парола "123Pass123"
    And Натиска бутона за вход в системата
    Then Вижда съобщение "Моля въведете потребителско име!".