Feature: Създаване на резервация

  Scenario: Резервация на филм от потребител
    Given Портебителя отваря екрана за създаване на резервации
    When Избира време 19:30
    And Избира място 34
    And Натиска бутона за създаване на Резервацията
    Then Вижда съобщение "Мястото е резервирано успешно.".
    
   Scenario: Опит за резервиране на вече заето място
    Given Портебителя отваря екрана за създаване на резервации
    When Избира време 19:30
    And Избира място 22
  	And Натиска бутона за създаване на Резервацията
    Then Вижда съобщение "Мястото вече е резервирано.".
    
   Scenario: Резервация която е по-малко от 60 минути преди прожекцията
    Given Портебителя отваря екрана за създаване на резервация
    When Въвежда потребителско име "Ivan123"
    And избира време 19:30
    And избира място 41
    And Натиска бутона за вход в системата
    Then Вижда съобщение "Съжаляваме но вече е късно за резервиране на място на тази прожекция!".
    
   Scenario: Резервация на несъществуващо място(>120)
    Given Портебителя отваря екрана за създаване на резервация
    When Избира място 155
    Then Вижда съобщение "Избраното място е невалидно!".
    